[
  {
    "image": "https://img.icons8.com/bubbles/300/tiktok.png",
    "title": "TikTok",
    "companyName": "TikTok Pte.",
    "id": 101,
    "description": "TikTok is the uncontested global leader in short-form mobile video, fundamentally shifting how entertainment, trends, and content consumption operate. Its core strength lies in its highly addictive For You Page (FYP), an algorithmic feed that learns user preferences with remarkable speed, delivering an endless stream of highly personalized clips, ranging from comedy sketches and dance challenges to educational content and niche tutorials. The platform empowers creation through an extensive library of sound effects, music, filters, and intuitive editing tools, making it easy for anyone to become a content creator. It’s a fast-paced cultural engine where viral trends ignite overnight and dominate global discourse.",
    "size": 200,
    "reviews": 12450,
    "ratingAvg": 4.6,
    "downloads": 5800000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 7100 }
    ]
  },
  {
    "image": "https://img.icons8.com/bubbles/300/instagram-new--v2.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 102,
    "description": "A visual-centric social media application, Instagram (owned by Meta) serves as a digital scrapbook and aspirational gallery. It allows users to share high-quality photos and short videos (Reels) with a focus on aesthetics and storytelling. The app is divided into several key areas: the main Feed for posts from followed accounts, Stories for ephemeral daily updates, Explore for discovering new content and accounts, and the Shopping tab for product discovery. It remains a powerful tool for personal branding, influencer marketing, and professional visual artists seeking to showcase their work to a massive global audience.",
    "size": 98,
    "reviews": 8900,
    "ratingAvg": 4.4,
    "downloads": 2100000,
    "ratings": [
      { "name": "1 star", "count": 310 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 4290 }
    ]
  },
  {
    "image": "https://img.icons8.com/bubbles/300/whatsapp.png",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 103,
    "description": "WhatsApp is the dominant instant messaging application worldwide, offering a simple, secure, and highly reliable platform for private communication. The service focuses heavily on end-to-end encryption to ensure that messages, voice calls, and video calls remain private between the sender and receiver. Key features include individual and group chats, voice notes, file sharing (documents, photos, and videos), and Status updates (similar to Stories). It is essential for global communication, often replacing traditional SMS and becoming the standard for personal, family, and small business interactions across continents.",
    "size": 120,
    "reviews": 35600,
    "ratingAvg": 4.7,
    "downloads": 15500000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 7200 },
      { "name": "5 star", "count": 24000 }
    ]
  },
  {
    "image": "https://img.icons8.com/clouds/300/facebook-new.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 104,
    "description": "The original mammoth of modern social networking, the Facebook mobile application is a comprehensive platform designed for connecting people across vast distances. It serves multiple functions: a feed for life updates from friends and family, a primary source for news and curated content, and a hub for community groups based on shared interests. Its features include photo albums, live video broadcasting, an integrated Marketplace for buying and selling, and event planning tools. Despite the rise of newer platforms, Facebook remains critical for maintaining long-term relationships and facilitating the digital presence of businesses and organizations.",
    "size": 85,
    "reviews": 18200,
    "ratingAvg": 4.5,
    "downloads": 7500000,
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 10450 }
    ]
  },
  {
    "image": "https://img.icons8.com/scribby/300/youtube-play.png",
    "title": "Youtube",
    "companyName": "Google LLC",
    "id": 105,
    "description": "YouTube is the undisputed global video sharing and streaming giant. The mobile app provides access to billions of videos across virtually every topic imaginable, ranging from feature-length films and professional music videos to vlogs, educational lectures, and gaming streams. The platform’s advanced recommendation engine drives hours of consumption, and its subscription model (YouTube Premium) offers ad-free viewing and background playback. It functions not only as an entertainment hub but as the world's second-largest search engine, a primary learning resource, and a massive monetization engine for creators.",
    "size": 150,
    "reviews": 6100,
    "ratingAvg": 4.8,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 4000 }
    ]
  },
  {
    "image": "https://img.icons8.com/fluency/300/telegram-app.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 106,
    "description": "Telegram is a cloud-based instant messaging service known for its speed, security (including optional end-to-end encrypted 'Secret Chats'), and robust features for large-scale communities. Unlike many competitors, Telegram excels at facilitating massive public communication through 'Channels' which can host unlimited subscribers, acting as broadcasting tools. It offers extensive customization, self-destructing messages, and powerful bots for automating tasks, making it a favorite for tech-savvy users, news outlets, and decentralized community building.",
    "size": 65,
    "reviews": 15900,
    "ratingAvg": 4.3,
    "downloads": 6500000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 7900 }
    ]
  },
  {
    "image": "https://img.icons8.com/3d-fluency/300/snapchat.png",
    "title": "SnapChat",
    "companyName": "Snap Inc",
    "id": 107,
    "description": "Snapchat redefined mobile communication by popularizing the concept of ephemeral content. The app's core feature is the Snap—a photo or video that is available only for a short time after opening. This focus on transient, in-the-moment sharing encourages playful, less-curated communication. It is renowned for its sophisticated augmented reality (AR) Lenses and filters, the 'Snap Map' for location sharing, and the 'Discover' tab for professional content from publishers.",
    "size": 40,
    "reviews": 25000,
    "ratingAvg": 4.6,
    "downloads": 10500000,
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5300 },
      { "name": "5 star", "count": 17050 }
    ]
  },
  {
    "image": "https://img.icons8.com/bubbles/300/bank.png",
    "title": "Bkash",
    "companyName": "Bkash Limited",
    "id": 108,
    "description": "Introducing bKash App, with an elegant look, and exciting features, to make your life simpler and easier. Register a bKash account right from the app in a few minutes, add money from your bank account or card, and get going. Recharge mobile balance, scan QR to pay at your favorite stores, pay utility and other bills from home, send money to people, and get different lifestyle services, all in a highly secure mobile money app. Discover the best bKash offers near you, get suggestions from bKash on what services you can explore next, and use shortcuts for your most frequent transactions in bKash App.",
    "size": 75,
    "reviews": 9800,
    "ratingAvg": 4.7,
    "downloads": 4800000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 5700 }
    ]
  },
  {
    "image": "https://img.icons8.com/external-those-icons-flat-those-icons/300/external-IMO-Logo-social-media-those-icons-flat-those-icons.png",
    "title": "Imo",
    "companyName": "imo.im",
    "id": 109,
    "description": "imo is a FREE, simple, and secure international calling app, messaging app, and chatting app. It's used by over 200M people in more than 170 countries and regions, supporting 62 languages. imo brings innovative solutions for seamless communication like WhatsApp, Telegram and BOTIM do, allowing people to share key moments with others.Free & HD Video Call Over 300 million free video call are made through imo every day, connecting people worldwide just like WhatsApp and BOTIM. Make international call to your family & friends for FREE. You can also create a group video chat with friends for free, just as you could on",
    "size": 110,
    "reviews": 7200,
    "ratingAvg": 4.2,
    "downloads": 1900000,
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 650 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2600 }
    ]
  },
  {
    "image": "https://img.icons8.com/doodle/300/netflix-desktop-app.png",
    "title": "NetFlix",
    "companyName": "Netflix LTD",
    "id": 110,
    "description": "Looking for the most talked about TV shows and movies from the around the world? They’re all on Netflix.We’ve got award-winning series, movies, documentaries, and stand-up specials. And with the mobile app, you get Netflix while you travel, commute, or just take a break.What you’ll love about Netflix:• We add TV shows and movies all the time. Browse new titles or search for your favorites, and stream videos right on your device.• The more you watch, the better Netflix gets at recommending TV shows and movies you’ll love.• Enjoy a safe watching experience just for kids with family-friendly entertainment.• Preview quick videos of our series and movies and get notifications for new episodes and releases.For complete terms and conditions, please visit http://www.netflix.com/termsofuse For privacy statement, please visit http://www.netflix.com/privacy",
    "size": 210,
    "reviews": 3500,
    "ratingAvg": 4.9,
    "downloads": 850000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 2350 }
    ]
  },
  {
    "image": "https://img.icons8.com/ios/300/grand-theft-auto-v.png",
    "title": "GTA V",
    "companyName": "GTA V C",
    "id": 111,
    "description": "Experience the blockbuster classic, updated for a new generation with across-the-board enhancements including brilliant new lighting and environmental upgrades, with high-resolution textures, increased draw distance, Grand Theft Auto V-style controls and targeting, and much more.Five years ago, Carl 'CJ' Johnson escaped the haze of Los Santos, San Andreas ... a city tearing itself apart with gang trouble, drugs, and corruption. Now, it's the early '90s. CJ’s got to go home — his mother has been murdered, his family has fallen apart, and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of cops frame him for homicide, forcing CJ on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets in the next iteration of the series that changed everything.- Created by Rockstar Games.Rockstar Games, Grand Theft Auto,Grand Theft Auto: The Trilogy – The Definitive Edition, Grand Theft Auto San Andreas – The Definitive Edition and [R* Logo] are marks/logos/copyrights of Take-Two Interactive. All rights reserved. Unreal® Engine, Copyright 1998–2023, Epic Games, Inc. All rights reserved. Uses Oodle. Copyright © 2008–2023 by Epic Game Tools, Inc. All other marks and trademarks are properties of their respective owners.Please note that the Data Safety information applies to information collected and used in this app. See the Netflix Privacy Statement to learn more about information we collect and use in this and other contexts, including at account registration.",
    "size": 60,
    "reviews": 11200,
    "ratingAvg": 4.5,
    "downloads": 3200000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 6400 }
    ]
  },
  {
    "image": "https://img.icons8.com/doodle/300/google-maps-new.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 112,
    "description": "Google Maps is the indispensable navigation and geographical information service. The mobile app provides highly accurate turn-by-turn navigation for driving, walking, cycling, and public transit, incorporating real-time traffic data to offer the fastest routes. Beyond navigation, it functions as a comprehensive local search tool, allowing users to discover, review, and get information on millions of businesses, restaurants, and points of interest globally. Its integration with user contributions (photos, reviews, and edits) makes it an ever-evolving digital atlas.",
    "size": 180,
    "reviews": 14500,
    "ratingAvg": 4.1,
    "downloads": 8800000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5600 }
    ]
  },
  {
    "image": "https://img.icons8.com/arcade/300/spotify.png",
    "title": "Spotify",
    "companyName": "Digital Paperworks",
    "id": 113,
    "description": "Spotify is the world’s most popular audio streaming service, offering a massive, licensed library of music, podcasts, and audiobooks. It operates on a freemium model, providing unlimited listening with ads for free users or an ad-free experience with enhanced features for premium subscribers. The platform is highly regarded for its powerful personalization algorithms, which curate playlists like Discover Weekly and Daily Mixes, exposing users to new content tailored to their specific tastes and listening habits.",
    "size": 80,
    "reviews": 6800,
    "ratingAvg": 4.7,
    "downloads": 2300000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 4000 }
    ]
  },
  {
    "image": "https://img.icons8.com/3d-fluency/300/amazon.png",
    "title": "Amazon",
    "companyName": "Amazon LTD",
    "id": 114,
    "description": "The Amazon Shopping app is the primary mobile interface for the world's largest e-commerce platform. It provides users with instant, on-the-go access to browse, search, and purchase millions of products across thousands of categories. The app enhances the shopping experience with features like one-click ordering, personalized recommendations, real-time tracking of shipments, and camera-based scanning for instant product look-up. It is an end-to-end retail solution that delivers convenience and unparalleled product variety directly to the consumer's pocket.",
    "size": 90,
    "reviews": 4200,
    "ratingAvg": 4.6,
    "downloads": 1100000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 2400 }
    ]
  },
  {
    "image": "https://img.icons8.com/doodle/300/uber-app.png",
    "title": "Uber",
    "companyName": "Digital Brushes Inc.",
    "id": 115,
    "description": "Uber is the dominant global ride-sharing and mobility application that connects riders with local drivers for on-demand private transportation. The app facilitates every aspect of the service, from requesting a ride and setting the destination to estimating the fare, tracking the vehicle's arrival in real-time, and handling cashless payment. It has expanded its functionality to include food delivery (Uber Eats) and other logistical services, fundamentally changing urban transit and the gig economy.",
    "size": 170,
    "reviews": 10500,
    "ratingAvg": 4.8,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 7100 }
    ]
  },
  {
    "image": "https://img.icons8.com/bubbles/300/chrome.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 116,
    "description": "Google Chrome is the most widely used web browser across desktop and mobile devices. The app is prized for its speed, minimalistic user interface, and robust synchronization capabilities, allowing users to seamlessly access their bookmarks, passwords, and browsing history across all their devices. It supports a vast ecosystem of web standards and offers essential features like Incognito Mode for private browsing, integrated Google search, and data saving mode to reduce mobile data usage.",
    "size": 70,
    "reviews": 16000,
    "ratingAvg": 4.4,
    "downloads": 6000000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 8000 }
    ]
  },
  {
    "image": "https://img.icons8.com/3d-fluency/300/gmail.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 117,
    "description": "Gmail is Google's universally adopted email service, offering a fast, intuitive, and highly functional mobile experience. It is characterized by its powerful built-in search functionality, extensive free cloud storage, and intelligent categorization features that automatically sort incoming messages into primary, social, and promotions tabs, minimizing inbox clutter. The app supports multiple accounts, integrates seamlessly with other Google services (Drive, Calendar), and employs sophisticated spam filtering for a secure communication environment.",
    "size": 45,
    "reviews": 5500,
    "ratingAvg": 4.5,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 650 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3000 }
    ]
  },
  {
    "image": "https://img.icons8.com/cute-clipart/300/zoom.png",
    "title": "Zoom",
    "companyName": "Culinary Tech Group",
    "id": 118,
    "description": "Zoom became the indispensable standard for high-quality, large-scale video conferencing and online meetings, especially in a professional and educational context. The app offers crystal-clear video and audio quality, robust screen-sharing capabilities, and features like breakout rooms, recording, and virtual backgrounds. Its simple-to-use interface and reliable performance have made it the go-to platform for remote work, virtual classrooms, and large public webinars.",
    "size": 105,
    "reviews": 9000,
    "ratingAvg": 4.7,
    "downloads": 3500000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 6000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/300/microsoft.png",
    "title": "Microshoft",
    "companyName": "Microsoft LTD.",
    "id": 119,
    "description": "Microsoft Teams is a central hub for workplace collaboration, tightly integrated within the Microsoft 365 ecosystem. The application combines instant persistent chat, video conferencing, file storage (via SharePoint and OneDrive), and application integration into a single interface. Organized into 'Teams' and 'Channels,' it facilitates structured group conversations, real-time document co-authoring, and seamless scheduling of meetings with colleagues, making it a powerhouse for modern corporate and enterprise environments.",
    "size": 50,
    "reviews": 7800,
    "ratingAvg": 4.8,
    "downloads": 2800000,
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 5400 }
    ]
  },
  {
    "image": "https://img.icons8.com/ios-filled/300/twitterx--v1.png",
    "title": "Twitter",
    "companyName": "X",
    "id": 120,
    "description": "X, formerly known as Twitter, is a real-time microblogging and social networking platform focused on the rapid sharing of short, text-based posts (tweets/posts), images, and videos. It is the primary global engine for immediate public discourse, breaking news, political commentary, and trending topics. Users follow individuals, brands, and news sources to build a personalized timeline, making it an essential tool for instant information consumption and contributing to public conversations with unique brevity.",
    "size": 350,
    "reviews": 32000,
    "ratingAvg": 4.3,
    "downloads": 12000000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 14000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/300/video-trimming.png",
    "title": "Capcut",
    "companyName": "Atmosphere Data Inc.",
    "id": 121,
    "description": "CapCut is a free, all-in-one video editing application optimized specifically for creating dynamic, high-quality content for social media, most notably TikTok. It is celebrated for its highly accessible and intuitive user interface, offering advanced features like keyframe animation, green screen effects, trending filters, and an enormous library of royalty-free music and sound effects, making professional-grade video creation simple for even casual mobile users.",
    "size": 30,
    "reviews": 19500,
    "ratingAvg": 4.5,
    "downloads": 9500000,
    "ratings": [
      { "name": "1 star", "count": 550 },
      { "name": "2 star", "count": 850 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://img.icons8.com/papercut/300/subway.png",
    "title": "Subway Surfers",
    "companyName": "Media Hub Solutions",
    "id": 122,
    "description": "Subway Surfers is one of the most downloaded and enduring endless runner mobile games. The objective is to guide a young graffiti artist, who has just been caught tagging a train, in a continuous sprint down active railway tracks to escape an inspector and his dog. Players must swipe to jump, slide, and switch lanes to dodge oncoming trains and obstacles while collecting coins and power-ups like jetpacks and hoverboards in a globally rotating 'World Tour' theme.",
    "size": 60,
    "reviews": 11800,
    "ratingAvg": 4.6,
    "downloads": 4500000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 3400 },
      { "name": "5 star", "count": 7050 }
    ]
  },
  {
    "image": "https://img.icons8.com/sf-black/300/pubg.png",
    "title": "Pubg Mobile",
    "companyName": "Connect World LLC",
    "id": 123,
    "description": "PUBG MOBILE (PlayerUnknown's Battlegrounds Mobile) is a foundational game in the mobile battle royale genre. Up to 100 players parachute onto a remote island, scavenge for weapons and gear, and engage in a winner-takes-all fight to be the last person or squad standing. The game is celebrated for its detailed maps, realistic graphics, diverse arsenal of weapons, and strategic gameplay, hosting massive global esports tournaments that drive its continued competitive relevance.",
    "size": 130,
    "reviews": 45000,
    "ratingAvg": 4.2,
    "downloads": 25000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4500 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 19500 }
    ]
  },
  {
    "image": "https://img.icons8.com/fluency/300/disney-plus.png",
    "title": "Disney +",
    "companyName": "Global Tutors Inc.",
    "id": 124,
    "description": "Disney+ is the premier subscription streaming service for content from The Walt Disney Company's major brands: Disney, Pixar, Marvel, Star Wars, National Geographic, and Star (in select regions). The mobile app provides access to a massive catalog of classic films, animated features, and exclusive, high-budget original series. It's designed as a family-friendly entertainment destination with robust parental controls and a focus on nostalgic and globally recognizable intellectual property.",
    "size": 95,
    "reviews": 8500,
    "ratingAvg": 4.9,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 350 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 6000 }
    ]
  }
]
